IDENTIFICATION DIVISION.
PROGRAM-ID.std_in_out.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
77 WKS-NAME PICTURE A(30).

PROCEDURE DIVISION.
  DISPLAY 'TYPE YOUR NAME'.
  ACCEPT WKS-NAME.
  DISPLAY 'YOUR NAME IS: ', WKS-NAME.
  STOP 'Pause'.
  STOP RUN.
